#### DuctShape Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing possible shapes for ducts.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum DuctShape ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DuctShape ``` |

| Visual C++ |
| --- |
| ``` public enum class DuctShape ``` |

# Members

| Member name | Description |
| --- | --- |
| Round | Round duct shape. |
| Rectangular | Rectangular duct shape. |
| Oval | Oval duct shape. |

# See Also

Autodesk.Revit.DB.Mechanical Namespace